IDENTIFICATION DIVSION.
PROGRAM-ID.  AssemblerNand2Tetris 
AUTHOR.  David G. Smith
DATA DIVISION.
WORKING-STORAGE SECTION.
01  ROMAddress PIC 9(5) VALUE ZEROS.
01  RAMAddress PIC 9(5) VALUE 16.
01  CompTable.
	02 CompBin OCCURS 28 TIME X(7).
	02 CompAsm OCCURS 28 TIMES XXX.
01  DestTable.
    02 DestBin OCCURS 8 TIMES X(6).
    02 DestAsm OCCURS 4 TIMES X(4).
01  JumpTable.
    02 JumpBin OCCURS 8 TIMES X(3).
    02 JumpAsm OCCURS 8 TIMES X(4).
01  PreDefTable.
    02 PreDefInt OCCURS 23 TIMES X(16).
    02 PreDefAsm OCCURS 23 TIMES X(5).
01  UserDefTable.
    02 UserDefSym OCCURS 500 TIMES X(80).
    02 UserDefBin OCCURS 500 TIMES X(16).
01  InputData.
    02 Lines OCCURS 1000 TIME X(80).
01  CurrentLine PIC X(80).
01  LineIndex PIC 9(4).
01  FileNameTables PIC X(64).
01  FileNameData PIC X(64).
01  FileNameOutput PIC X(64).
PROCEDURE DIVISION.
*>  Build compDestJumpPredef tables
*>  first pass - if array has more lines advance
*>    ignore comments and white toclassify
*>    A or C - romAddress++
*>    L - put in userdef table with romAddress binary
*>  reset to front of array
*>  second pass- if array has more lines advance
*>    ignore cooments and white space to classify
*>      A Cmd - remove @
*>        If numeric convert to binary and write to file
*>        else if predef lookup binary and write to file
*>        else if userdef lookup binary and write to file
*>        else if new, add to userdef with ramAddress then ramAddress++
*>      C Cmd
*>        if contains "=" lookup comp and concat with lookup dest
*>        else if xontains ";" lookup comp and concat with lookup jump
*>        concat 111 to front of string
*>        write to file
*>    close file
